#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azuread_client_config.current: Reading...
data.azuread_client_config.current: Read complete after 0s [id=26aa7ec7-96f9-4fda-a56c-b330c975f800-8e001e75-263f-4b2f-931e-f2037fcc675f-a26cff92-ab53-4342-8e68-f96dd7bbd9b4]
azuread_application.github_actions_aadapplication["apim-managed-test-dev"]: Refreshing state... [id=b2d7c879-b315-4ae9-bf46-46f6ce9fd882]
azuread_application.github_actions_aadapplication["azure-functions-playground"]: Refreshing state... [id=96051860-a27e-4eeb-9008-ef3227af90fd]
azuread_application.github_actions_aadapplication["tf-github-repo-management"]: Refreshing state... [id=912b61f9-737f-4c60-8dd8-c2af36fbc44b]
azuread_application.github_actions_aadapplication["tf-sandbox"]: Refreshing state... [id=5e3da8bf-1ebb-4b6f-96ee-17f1eb4c5d55]
azuread_application.github_actions_aadapplication["backstage_test"]: Refreshing state... [id=96fd3546-c563-4995-b477-88da8c572ba5]
azuread_application_federated_identity_credential.cred["tf-github-repo-management"]: Refreshing state... [id=912b61f9-737f-4c60-8dd8-c2af36fbc44b/federatedIdentityCredential/e920d867-cc2c-4cff-82ac-c39bba3a52b9]
azuread_application_federated_identity_credential.cred["azure-functions-playground"]: Refreshing state... [id=96051860-a27e-4eeb-9008-ef3227af90fd/federatedIdentityCredential/be9764f4-91f1-4a0c-8fd6-c7faf47f66f5]
azuread_application_federated_identity_credential.cred["backstage_test"]: Refreshing state... [id=96fd3546-c563-4995-b477-88da8c572ba5/federatedIdentityCredential/780736fb-df2b-4609-80e8-eab432153ec6]
azuread_application_federated_identity_credential.cred["apim-managed-test-dev"]: Refreshing state... [id=b2d7c879-b315-4ae9-bf46-46f6ce9fd882/federatedIdentityCredential/bf28ed1a-9dce-4d7b-b060-2ef4afbc37ac]
azuread_service_principal.github_actions_sp["tf-github-repo-management"]: Refreshing state... [id=1b1ecaef-d090-4fa5-9fc4-5adb820e3137]
azuread_application_federated_identity_credential.cred["tf-sandbox"]: Refreshing state... [id=5e3da8bf-1ebb-4b6f-96ee-17f1eb4c5d55/federatedIdentityCredential/c85dfb45-807d-4473-a4bf-1c9901ed24aa]
azuread_service_principal.github_actions_sp["azure-functions-playground"]: Refreshing state... [id=5ac34ad8-49f7-4bc7-af91-ce78cf9f4590]
azuread_service_principal.github_actions_sp["tf-sandbox"]: Refreshing state... [id=b9d819c2-e68a-4d3c-862d-692c9716e8bd]
azuread_service_principal.github_actions_sp["apim-managed-test-dev"]: Refreshing state... [id=a112bfb0-88fb-46f5-a19b-e00ba99c51a4]
azuread_service_principal.github_actions_sp["backstage_test"]: Refreshing state... [id=a7661791-72fe-4907-a9b2-2aa885ef3ea5]
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common]
azurerm_storage_account.terraform_state_storage: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common/providers/Microsoft.Storage/storageAccounts/badbortcommontfstatesta]
azurerm_storage_container.tf_backends_sc["apim-managed-test"]: Refreshing state... [id=https://badbortcommontfstatesta.blob.core.windows.net/apim-managed-test]
azurerm_storage_container.terraform_state: Refreshing state... [id=https://badbortcommontfstatesta.blob.core.windows.net/common-infrastructure-tfstate]
azurerm_storage_container.tf_backends_sc["tf-github-repo-management"]: Refreshing state... [id=https://badbortcommontfstatesta.blob.core.windows.net/tf-github-repo-management]
azurerm_storage_container.tf_backends_sc["backstage_test"]: Refreshing state... [id=https://badbortcommontfstatesta.blob.core.windows.net/backstage-test]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.instance["apim-managed-test-dev"] will be created
  + resource "azurerm_resource_group" "instance" {
      + id       = (known after apply)
      + location = "australiaeast"
      + name     = "rg-apim-managed-test"
    }

  # azurerm_role_assignment.instance["apim-managed-test-dev"] will be created
  + resource "azurerm_role_assignment" "instance" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b2d7c879-b315-4ae9-bf46-46f6ce9fd882"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @badbort, Action: `pull_request`, Working Directory: ``, Workflow: `.github/workflows/terraform.yml`*